# Loading Data of Different Formats into a pandas DataFrame

Let's discover how to import different types of data, such as CSV, TSV, and XLSX, into a pandas DataFrame.

First, let's import pandas library and save the Top 10 Postcodes for the First Home Owner Grants dataset into a DataFrame called `csv_df`

In [0]:
import pandas as pd

In [0]:
csv_url = 'https://raw.githubusercontent.com/PacktWorkshops/The-Data-Science-Workshop/master/Chapter01/Dataset/overall_topten_2012-2013.csv'

In [0]:
csv_df = pd.read_csv(csv_url, skiprows=1)

In [0]:
csv_df

   Number  ...  Number of Applications
0       1  ...                    1069
1       2  ...                    1037
2       3  ...                     821
3       4  ...                     816
4       5  ...                     530
5       6  ...                     479
6       7  ...                     383
7       8  ...                     351
8       9  ...                     344
9      10  ...                     335

[10 rows x 4 columns]

Different than previous dataset file (a CSV - Comma Separated Values), now we're going to import the same dataset but as a TSV (Tab-Separated Values).

In [0]:
tsv_url = 'https://raw.githubusercontent.com/PacktWorkshops/The-Data-Science-Workshop/master/Chapter01/Dataset/overall_topten_2012-2013.tsv'

In [0]:
tsv_df = pd.read_csv(tsv_url, skiprows=1, sep='\t')
tsv_df

   Number  ...  Number of Applications
0       1  ...                    1069
1       2  ...                    1037
2       3  ...                     821
3       4  ...                     816
4       5  ...                     530
5       6  ...                     479
6       7  ...                     383
7       8  ...                     351
8       9  ...                     344
9      10  ...                     335

[10 rows x 4 columns]

At least, we do the same as previous but with a Excel file (xlsx extension)

In [0]:
xlsx_url = 'https://github.com/PacktWorkshops/The-Data-Science-Workshop/blob/master/Chapter01/Dataset/overall_topten_2012-2013.xlsx?raw=true'

In [0]:
xlsx_df = pd.read_excel(xlsx_url)
xlsx_df

Empty DataFrame
Columns: [This tab doesn't contain the data we are looking for]
Index: []

In [0]:
xlsx_df1 = pd.read_excel(xlsx_url, skiprows=1, sheet_name=1)
xlsx_df1

   Number  ...  Number of Applications
0       1  ...                    1069
1       2  ...                    1037
2       3  ...                     821
3       4  ...                     816
4       5  ...                     530
5       6  ...                     479
6       7  ...                     383
7       8  ...                     351
8       9  ...                     344
9      10  ...                     335

[10 rows x 4 columns]